IRP/src/Documents/SalesInvoice/SalesInvoice.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SalesInvoice</name>
  <registerRecords>AccumulationRegister.ItemsInStores</registerRecords>
  <registerRecords>AccumulationRegister.OrderBalance</registerRecords>
  <registerRecords>AccumulationRegister.OrderReservation</registerRecords>
  <registerRecords>AccumulationRegister.InventoryBalance</registerRecords>
  <registerRecords>AccumulationRegister.GoodsInTransitOutgoing</registerRecords>
  <registerRecords>AccumulationRegister.StockBalance</registerRecords>
  <registerRecords>AccumulationRegister.StockReservation</registerRecords>
  <registerRecords>AccumulationRegister.SalesTurnovers</registerRecords>
  <registerRecords>AccumulationRegister.ShipmentOrders</registerRecords>
  <registerRecords>AccumulationRegister.PartnerArTransactions</registerRecords>
  <registerRecords>AccumulationRegister.AdvanceFromCustomers</registerRecords>
  <registerRecords>AccumulationRegister.RevenuesTurnovers</registerRecords>
  <registerRecords>AccumulationRegister.ShipmentConfirmationSchedule</registerRecords>
  <registerRecords>AccumulationRegister.ReconciliationStatement</registerRecords>
  <registerRecords>AccumulationRegister.TaxesTurnovers</registerRecords>
  <attributes>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>DateOfShipment</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Manager</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>BasisDocument</name>
    <type>
      <types>DefinedType.typeBasisDocumentSalesInvoice</types>
    </type>
  </attributes>
  <attributes>
    <name>Agreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceIncludeTax</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ManagerSegment</name>
    <type>
      <types>CatalogRef.PartnerSegments</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>IsOpeningEntry</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemList</name>
    <attributes>
      <name>TotalAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>NetAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Store</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>OffersAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.typePrice</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>PriceType</name>
      <type>
        <types>CatalogRef.PriceTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesOrder</name>
      <type>
        <types>DocumentRef.SalesOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>ShipmentConfirmation</name>
      <type>
        <types>DocumentRef.ShipmentConfirmation</types>
        <types>DocumentRef.SalesOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Detail</name>
      <type>
        <types>DefinedType.typeDescription</types>
      </type>
    </attributes>
    <attributes>
      <name>BusinessUnit</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>RevenueType</name>
      <type>
        <types>CatalogRef.ExpenseAndRevenueTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>AdditionalAnalytic</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SpecialOffers</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Offer</name>
      <type>
        <types>CatalogRef.SpecialOffers</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>DefinedType.typePercent</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>TaxList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Tax</name>
      <type>
        <types>CatalogRef.Taxes</types>
      </type>
    </attributes>
    <attributes>
      <name>Analytics</name>
      <type>
        <types>CatalogRef.TaxAnalytics</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxRate</name>
      <type>
        <types>CatalogRef.TaxRates</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>IncludeToTotalAmount</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ManualAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Currencies</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyFrom</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ReverseRate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowReverseRate</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Multiplicity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MovementType</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Documents/SalesInvoice/Forms/SelectShipmentConfirmationsForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	If Parameters.Property("InfoShipmentConfirmations") Then
		FillShipmentConfirmationTree(Parameters.InfoShipmentConfirmations);
	Else
		Cancel = True;
	EndIf;
EndProcedure

&AtServer
Procedure FillShipmentConfirmationTree(InfoShipmentConfirmations)
	ThisObject.ShipmentConfirmationsTree.GetItems().Clear();
	
	For Each Row_Order In InfoShipmentConfirmations Do
		NewRow_Order = ThisObject.ShipmentConfirmationsTree.GetItems().Add();
		NewRow_Order.Order = Row_Order.Order;
		For Each Row_ShipmentConfirmation In Row_Order.Rows Do
			NewRow_ShipmentConfirmation = NewRow_Order.GetItems().Add();
			NewRow_ShipmentConfirmation.ShipmentConfirmation = Row_ShipmentConfirmation.ShipmentConfirmation;
			For Each Row_Item In Row_ShipmentConfirmation.Rows Do
				NewRow_Item = NewRow_ShipmentConfirmation.GetItems().Add();
				NewRow_Item.Item = Row_Item.Item;
				NewRow_Item.ItemKey = Row_Item.ItemKey;
				NewRow_Item.RowKey = Row_Item.RowKey;
				NewRow_Item.Unit = Row_Item.Unit;
				NewRow_Item.Quantity = Row_Item.Quantity;
			EndDo;
		EndDo;
	EndDo;
	
EndProcedure

&AtClient
Procedure ShipmentConfirmationsTreeBeforeAddRow(Item, Cancel, Clone, Parent, IsFolder, Parameter)
	Cancel = True;
EndProcedure

&AtClient
Procedure ShipmentConfirmationsTreeBeforeDeleteRow(Item, Cancel)
	Cancel = True;
EndProcedure

&AtClient
Procedure Ok(Command)
	Close(GetSelectedShipmentConfirmations());
EndProcedure

&AtServer
Function GetSelectedShipmentConfirmations()
	Result = New Array();
	For Each Row_Order In ThisObject.ShipmentConfirmationsTree.GetItems() Do
		For Each Row_ShipmentConfirmation In Row_Order.GetItems() Do
			If Row_ShipmentConfirmation.Use Then
				Result.Add(Row_ShipmentConfirmation.ShipmentConfirmation);
			EndIf;
		EndDo;
	EndDo;
	Return Result;
EndFunction

&AtClient
Procedure Cancel(Command)
	Close();
EndProcedure

&AtClient
Procedure SelectAll(Command)
	SetUseValue(True);
EndProcedure

&AtClient
Procedure UnselectAll(Command)
	SetUseValue(False);
EndProcedure

&AtClient
Procedure SetUseValue(UseValue)
	For Each Row_Order In ThisObject.ShipmentConfirmationsTree.GetItems() Do
		For Each Row_ShipmentConfirmation In Row_Order.GetItems() Do
			Row_ShipmentConfirmation.Use = UseValue;
		EndDo;
	EndDo;
EndProcedure
